identification division.
       program-id. Algo-Euclide.
       author. Euclide.
       date-written. 300 BNC.
environment division.
       configuration section.
       source-computer. x8086.
       object-computer. LLVM.
